dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/CPUSS_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="CPUSS" HW_revision="1.0">
    <register id="CPUSS_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="INT_CFG" description="Event line mode select" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="Event handled by software. Software must clear the associated RIS flag."/>
            <bitenum id="HARDWARE" value="0x2" description="Event handled by hardware. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="CPUSS_DESC" width="32" offset="0x10FC" description="Module Description">
        <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Set for the module *instance*" begin="15" end="12" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R">
        </bitfield>
    </register>
    <group id="CPUSS_CPU_INT_GROUP0" name="CPUSS_CPU_INT_GROUP0" instances="1" offset="0x1100" instaddr="0x30" description="">
        <register id="CPUSS_CPU_INT_GROUP0_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No pending interrupt"/>
                <bitenum id="INT0" value="0x1" description="Interrupt 0"/>
                <bitenum id="INT1" value="0x2" description="Interrupt 1"/>
                <bitenum id="INT2" value="0x3" description="Interrupt 2"/>
                <bitenum id="INT3" value="0x4" description="Interrupt 3"/>
                <bitenum id="INT4" value="0x5" description="Interrupt 4"/>
                <bitenum id="INT5" value="0x6" description="Interrupt 5"/>
                <bitenum id="INT6" value="0x7" description="Interrupt 6"/>
                <bitenum id="INT7" value="0x8" description="Interrupt 7"/>
            </bitfield>
        </register>
        <register id="CPUSS_CPU_INT_GROUP0_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="INT" description="Masks the corresponding interrupt" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="INT0" value="0x1" description="Interrupt 0"/>
                <bitenum id="INT1" value="0x2" description="Interrupt 1"/>
                <bitenum id="INT2" value="0x4" description="Interrupt 2"/>
                <bitenum id="INT3" value="0x8" description="Interrupt 3"/>
                <bitenum id="INT4" value="0x10" description="Interrupt 4"/>
                <bitenum id="INT5" value="0x20" description="Interrupt 5"/>
                <bitenum id="INT6" value="0x40" description="Interrupt 6"/>
                <bitenum id="INT7" value="0x80" description="Interrupt 7"/>
            </bitfield>
        </register>
        <register id="CPUSS_CPU_INT_GROUP0_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="INT" description="Raw interrupt status for INT" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="INT0" value="0x1" description="Interrupt 0"/>
                <bitenum id="INT1" value="0x2" description="Interrupt 1"/>
                <bitenum id="INT2" value="0x4" description="Interrupt 2"/>
                <bitenum id="INT3" value="0x8" description="Interrupt 3"/>
                <bitenum id="INT4" value="0x10" description="Interrupt 4"/>
                <bitenum id="INT5" value="0x20" description="Interrupt 5"/>
                <bitenum id="INT6" value="0x40" description="Interrupt 6"/>
                <bitenum id="INT7" value="0x80" description="Interrupt 7"/>
            </bitfield>
        </register>
        <register id="CPUSS_CPU_INT_GROUP0_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="INT" description="Masked interrupt status for INT0" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="INT0" value="0x1" description="Interrupt 0"/>
                <bitenum id="INT1" value="0x2" description="Interrupt 1"/>
                <bitenum id="INT2" value="0x4" description="Interrupt 2"/>
                <bitenum id="INT3" value="0x8" description="Interrupt 3"/>
                <bitenum id="INT4" value="0x10" description="Interrupt 4"/>
                <bitenum id="INT5" value="0x20" description="Interrupt 5"/>
                <bitenum id="INT6" value="0x40" description="Interrupt 6"/>
                <bitenum id="INT7" value="0x80" description="Interrupt 7"/>
            </bitfield>
        </register>
        <register id="CPUSS_CPU_INT_GROUP0_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="INT" description="Sets INT in RIS register" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="INT0" value="0x1" description="Interrupt 0"/>
                <bitenum id="INT1" value="0x2" description="Interrupt 1"/>
                <bitenum id="INT2" value="0x4" description="Interrupt 2"/>
                <bitenum id="INT3" value="0x8" description="Interrupt 3"/>
                <bitenum id="INT4" value="0x10" description="Interrupt 4"/>
                <bitenum id="INT5" value="0x20" description="Interrupt 5"/>
                <bitenum id="INT6" value="0x40" description="Interrupt 6"/>
                <bitenum id="INT7" value="0x80" description="Interrupt 7"/>
            </bitfield>
        </register>
        <register id="CPUSS_CPU_INT_GROUP0_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="INT" description="Clears INT in RIS register" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="INT0" value="0x1" description="Interrupt 0"/>
                <bitenum id="INT1" value="0x2" description="Interrupt 1"/>
                <bitenum id="INT2" value="0x4" description="Interrupt 2"/>
                <bitenum id="INT3" value="0x8" description="Interrupt 3"/>
                <bitenum id="INT4" value="0x10" description="Interrupt 4"/>
                <bitenum id="INT5" value="0x20" description="Interrupt 5"/>
                <bitenum id="INT6" value="0x40" description="Interrupt 6"/>
                <bitenum id="INT7" value="0x80" description="Interrupt 7"/>
            </bitfield>
        </register>
        </group>
    <group id="CPUSS_CPU_INT_GROUP1" name="CPUSS_CPU_INT_GROUP1" instances="1" offset="0x1130" instaddr="0x30" description="">
        <register id="CPUSS_CPU_INT_GROUP1_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No pending interrupt"/>
                <bitenum id="INT0" value="0x1" description="Interrupt 0"/>
                <bitenum id="INT1" value="0x2" description="Interrupt 1"/>
                <bitenum id="INT2" value="0x3" description="Interrupt 2"/>
                <bitenum id="INT3" value="0x4" description="Interrupt 3"/>
                <bitenum id="INT4" value="0x5" description="Interrupt 4"/>
                <bitenum id="INT5" value="0x6" description="Interrupt 5"/>
                <bitenum id="INT6" value="0x7" description="Interrupt 6"/>
                <bitenum id="INT7" value="0x8" description="Interrupt 7"/>
            </bitfield>
        </register>
        <register id="CPUSS_CPU_INT_GROUP1_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="INT" description="Masks the corresponding interrupt" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="INT0" value="0x1" description="Interrupt 0"/>
                <bitenum id="INT1" value="0x2" description="Interrupt 1"/>
                <bitenum id="INT2" value="0x4" description="Interrupt 2"/>
                <bitenum id="INT3" value="0x8" description="Interrupt 3"/>
                <bitenum id="INT4" value="0x10" description="Interrupt 4"/>
                <bitenum id="INT5" value="0x20" description="Interrupt 5"/>
                <bitenum id="INT6" value="0x40" description="Interrupt 6"/>
                <bitenum id="INT7" value="0x80" description="Interrupt 7"/>
            </bitfield>
        </register>
        <register id="CPUSS_CPU_INT_GROUP1_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="INT" description="Raw interrupt status for INT" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="INT0" value="0x1" description="Interrupt 0"/>
                <bitenum id="INT1" value="0x2" description="Interrupt 1"/>
                <bitenum id="INT2" value="0x4" description="Interrupt 2"/>
                <bitenum id="INT3" value="0x8" description="Interrupt 3"/>
                <bitenum id="INT4" value="0x10" description="Interrupt 4"/>
                <bitenum id="INT5" value="0x20" description="Interrupt 5"/>
                <bitenum id="INT6" value="0x40" description="Interrupt 6"/>
                <bitenum id="INT7" value="0x80" description="Interrupt 7"/>
            </bitfield>
        </register>
        <register id="CPUSS_CPU_INT_GROUP1_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="INT" description="Masked interrupt status for INT0" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="INT0" value="0x1" description="Interrupt 0"/>
                <bitenum id="INT1" value="0x2" description="Interrupt 1"/>
                <bitenum id="INT2" value="0x4" description="Interrupt 2"/>
                <bitenum id="INT3" value="0x8" description="Interrupt 3"/>
                <bitenum id="INT4" value="0x10" description="Interrupt 4"/>
                <bitenum id="INT5" value="0x20" description="Interrupt 5"/>
                <bitenum id="INT6" value="0x40" description="Interrupt 6"/>
                <bitenum id="INT7" value="0x80" description="Interrupt 7"/>
            </bitfield>
        </register>
        <register id="CPUSS_CPU_INT_GROUP1_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="INT" description="Sets INT in RIS register" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="INT0" value="0x1" description="Interrupt 0"/>
                <bitenum id="INT1" value="0x2" description="Interrupt 1"/>
                <bitenum id="INT2" value="0x4" description="Interrupt 2"/>
                <bitenum id="INT3" value="0x8" description="Interrupt 3"/>
                <bitenum id="INT4" value="0x10" description="Interrupt 4"/>
                <bitenum id="INT5" value="0x20" description="Interrupt 5"/>
                <bitenum id="INT6" value="0x40" description="Interrupt 6"/>
                <bitenum id="INT7" value="0x80" description="Interrupt 7"/>
            </bitfield>
        </register>
        <register id="CPUSS_CPU_INT_GROUP1_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="INT" description="Clears INT in RIS register" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="INT0" value="0x1" description="Interrupt 0"/>
                <bitenum id="INT1" value="0x2" description="Interrupt 1"/>
                <bitenum id="INT2" value="0x4" description="Interrupt 2"/>
                <bitenum id="INT3" value="0x8" description="Interrupt 3"/>
                <bitenum id="INT4" value="0x10" description="Interrupt 4"/>
                <bitenum id="INT5" value="0x20" description="Interrupt 5"/>
                <bitenum id="INT6" value="0x40" description="Interrupt 6"/>
                <bitenum id="INT7" value="0x80" description="Interrupt 7"/>
            </bitfield>
        </register>
        </group>
    <register id="CPUSS_CTL" width="32" offset="0x1300" description="Prefetch/Cache control">
        <bitfield id="PREFETCH" description="Used to enable/disable instruction prefetch to Flash." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable instruction prefetch."/>
            <bitenum id="ENABLE" value="0x1" description="Enable instruction prefetch."/>
        </bitfield>
        <bitfield id="ICACHE" description="Used to enable/disable Instruction caching on flash access." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable instruction caching."/>
            <bitenum id="ENABLE" value="0x1" description="Enable instruction caching."/>
        </bitfield>
        <bitfield id="LITEN" description="Literal caching and prefetch enable. 
This bit is a subset of ICACHE/PREFETCH bit i.e. literal caching or literal prefetching will only happen if ICACHE or PREFETCH bits have been set respectively

When enabled, the cache and prefetcher structures inside CPUSS will cache and prefetch literals
When disabled, the cache and prefetcher structures inside CPUSS will not cache and prefetch literals" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Literal caching disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Literal caching enabled"/>
        </bitfield>
    </register>

</module>